## Author: Dere, Abdulhameed Abiola

## DATA CLEANING

To build any machine learning model or work as a data scientist, it is important to understand how to clean a dataset. In more than 90% of cases, the data will be "messy", therefore this notebook aims to explore the common cleaning methods which you should be conversant and comfortable with after tis session.

### For this session, we would make use of two datasets.

In [1]:
# import the required libraries

import pandas as pd
import numpy as np

In [2]:
# Read in the required dataset

data = pd.read_csv('Loan prediction train.csv')

data.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [3]:
df = pd.read_csv('Big Mart Sales Prediction Train.csv')

df.head()
# df.info()

,Item_Identifier,Item_Weight,Item_Fat_Content,Item_Visibility,Item_Type,Item_MRP,Outlet_Identifier,Outlet_Establishment_Year,Outlet_Size,Outlet_Location_Type,Outlet_Type,Item_Outlet_Sales
0,FDA15,9.30,Low Fat,0.016047,Dairy,249.8092,OUT049,1999,Medium,Tier 1,Supermarket Type1,3735.1380
1,DRC01,5.92,Regular,0.019278,Soft Drinks,48.2692,OUT018,2009,Medium,Tier 3,Supermarket Type2,443.4228
2,FDN15,17.50,Low Fat,0.016760,Meat,141.6180,OUT049,1999,Medium,Tier 1,Supermarket Type1,2097.2700
3,FDX07,19.20,Regular,0.000000,Fruits and Vegetables,182.0950,OUT010,1998,NaN,Tier 3,Grocery Store,732.3800
4,NCD19,8.93,Low Fat,0.000000,Household,53.8614,OUT013,1987,High,Tier 3,Supermarket Type1,994.7052

In [4]:
# Check the number of rows and columns
data.shape

(614, 13)

In [5]:
# Check additional information about the dataframe
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Loan_ID            614 non-null    object
 1   Gender             601 non-null    object
 2   Married            611 non-null    object
 3   Dependents         599 non-null    object
 4   Education          614 non-null    object
 5   Self_Employed      582 non-null    object
 6   ApplicantIncome    614 non-null    int64
 7   CoapplicantIncome  614 non-null    float64
 8   LoanAmount         592 non-null    float64
 9   Loan_Amount_Term   600 non-null    float64
 10  Credit_History     564 non-null    float64
 11  Property_Area      614 non-null    object
 12  Loan_Status        614 non-null    object
dtypes: float64(4), int64(1), object(8)
memory usage: 62.5+ KB

## DESCRIBING/SORTING DATA

Describe function is used to carry out some statistical functions on the dataframe. Describe functions works only on the integer and float values BUT does not work on the object values i.e. string values

In [6]:
# data.describe() method gives an idea of the nature of the data that we are working with.
# It also makes it easy to draw out inferences from the dataset
# This also gives an idea of the presence of an outlier or not, which can later be confirmed by visualization
data.describe()

,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History
count,614.000000,614.000000,592.000000,600.00000,564.000000
mean,5403.459283,1621.245798,146.412162,342.00000,0.842199
std,6109.041673,2926.248369,85.587325,65.12041,0.364878
min,150.000000,0.000000,9.000000,12.00000,0.000000
25%,2877.500000,0.000000,100.000000,360.00000,1.000000
50%,3812.500000,1188.500000,128.000000,360.00000,1.000000
75%,5795.000000,2297.250000,168.000000,360.00000,1.000000
max,81000.000000,41667.000000,700.000000,480.00000,1.000000

In [7]:
# Statsitical inference of the categorical Dataset
data.describe(include = 'object')

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,Property_Area,Loan_Status
count,614,601,611,599,614,582,614,614
unique,614,2,2,4,2,2,3,2
top,LP001616,Male,Yes,0,Graduate,No,Semiurban,Y
freq,1,489,398,345,480,500,233,422

## SORT FUNCTION

This is used to arrange the data in a dataframe in a chronological order either in an ascending or descending format.

In [8]:
# This sort the dataframe based on the Educational status, i.e all graduates come first before the non-graduates.
data.sort_values("Education")
# data.sort_values('ApplicantIncome', ascending = False)

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
382,LP002231,Female,No,0,Graduate,No,6000,0.0,156.0,360.0,1.0,Urban,Y
381,LP002229,Male,No,0,Graduate,No,5941,4232.0,296.0,360.0,1.0,Semiurban,Y
380,LP002226,Male,Yes,0,Graduate,NaN,3333,2500.0,128.0,360.0,1.0,Semiurban,Y
379,LP002225,Male,Yes,2,Graduate,No,5391,0.0,130.0,360.0,1.0,Urban,Y
...,...,...,...,...,...,...,...,...,...,...,...,...,...
510,LP002637,Male,No,0,Not Graduate,No,3598,1287.0,100.0,360.0,1.0,Rural,N
179,LP001630,Male,No,0,Not Graduate,No,2333,1451.0,102.0,480.0,0.0,Urban,N
73,LP001250,Male,Yes,3+,Not Graduate,No,4755,0.0,95.0,NaN,0.0,Semiurban,N
426,LP002367,Female,No,1,Not Graduate,No,4606,0.0,81.0,360.0,1.0,Rural,N
226,LP001754,Male,Yes,NaN,Not Graduate,Yes,4735,0.0,138.0,360.0,1.0,Urban,N

## MAKING CHANGES TO THE DATAFRAME

### Adding a new column to the dataframe
Assuming we decide to get the difference between the income of the applicant and the coapplicant
And we want to put that into a new column

In [9]:
# Instatiate a new column
data['IncomeDifference'] = data['ApplicantIncome'] - data['CoapplicantIncome']

In [10]:
data.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status,IncomeDifference
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y,5849.0
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N,3075.0
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y,3000.0
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y,225.0
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y,6000.0

### Dropping an existing column from the dataframe

In [11]:
data = data.drop(columns = 'IncomeDifference')
# data = data.drop('IncomeDifference', axis = 1)  This is another method of dropping an existing column
data.head(2)

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N

## FILTERING DATA

This allows pandas to filter through the entire dataframe in search for specific rows/columns and further reduces the dataframe size

In [12]:
data.loc[(data['Education'] == 'Graduate') & (data['Dependents'] == '0')]

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y
13,LP001029,Male,No,0,Graduate,No,1853,2840.0,114.0,360.0,1.0,Rural,N
15,LP001032,Male,No,0,Graduate,No,4950,0.0,125.0,360.0,1.0,Urban,Y
...,...,...,...,...,...,...,...,...,...,...,...,...,...
598,LP002945,Male,Yes,0,Graduate,Yes,9963,0.0,180.0,360.0,1.0,Rural,Y
603,LP002958,Male,No,0,Graduate,No,3676,4301.0,172.0,360.0,1.0,Rural,Y
608,LP002974,Male,Yes,0,Graduate,No,3232,1950.0,108.0,360.0,1.0,Rural,Y
609,LP002978,Female,No,0,Graduate,No,2900,0.0,71.0,360.0,1.0,Rural,Y
613,LP002990,Female,No,0,Graduate,Yes,4583,0.0,133.0,360.0,0.0,Semiurban,N

In [13]:
# To shrinken the size of a dataframe based on name tags

df.loc[df['Item_Type'].str.contains('Meat')]

,Item_Identifier,Item_Weight,Item_Fat_Content,Item_Visibility,Item_Type,Item_MRP,Outlet_Identifier,Outlet_Establishment_Year,Outlet_Size,Outlet_Location_Type,Outlet_Type,Item_Outlet_Sales
2,FDN15,17.500,Low Fat,0.016760,Meat,141.6180,OUT049,1999,Medium,Tier 1,Supermarket Type1,2097.2700
41,FDK43,9.800,Low Fat,0.026818,Meat,126.0020,OUT013,1987,High,Tier 3,Supermarket Type1,2150.5340
61,FDV27,7.970,Regular,0.040071,Meat,87.3514,OUT045,2002,NaN,Tier 2,Supermarket Type1,1062.6168
66,FDH19,19.350,Low Fat,0.033082,Meat,172.5738,OUT035,2004,Small,Tier 2,Supermarket Type1,4865.6664
89,FDN27,20.850,Low Fat,0.039624,Meat,117.2808,OUT049,1999,Medium,Tier 1,Supermarket Type1,1523.3504
...,...,...,...,...,...,...,...,...,...,...,...,...
8443,FDX15,17.200,LF,0.156542,Meat,162.4578,OUT049,1999,Medium,Tier 1,Supermarket Type1,2888.2404
8460,FDN39,19.350,Regular,0.065508,Meat,168.9816,OUT035,2004,Small,Tier 2,Supermarket Type1,2852.2872
8470,FDW27,5.860,Regular,0.151088,Meat,155.1314,OUT049,1999,Medium,Tier 1,Supermarket Type1,1551.3140
8491,FDO03,10.395,Regular,0.037033,Meat,227.9352,OUT018,2009,Medium,Tier 3,Supermarket Type2,4809.7392
8513,FDH31,12.000,Regular,0.020407,Meat,99.9042,OUT035,2004,Small,Tier 2,Supermarket Type1,595.2252

## AGGREGATE STATISTICS (GROUPBY)

This allows pandas to be able to perform a lot more statistical operations with datadrame set

In [14]:
df.groupby(['Item_Fat_Content']).mean()

,Item_Weight,Item_Visibility,Item_MRP,Outlet_Establishment_Year,Item_Outlet_Sales
Item_Fat_Content,,,,,
LF,12.803212,0.066628,138.788311,1997.936709,2073.551928
Low Fat,12.953079,0.064166,140.968921,1997.847121,2164.477336
Regular,12.705840,0.069564,141.714476,1997.807892,2235.186702
low fat,12.563988,0.065300,134.569043,1995.883929,2087.740737
reg,12.842642,0.066361,136.313513,1999.341880,1962.192268

In [15]:
df.groupby(['Item_Fat_Content']).mean().sort_values('Outlet_Establishment_Year')

,Item_Weight,Item_Visibility,Item_MRP,Outlet_Establishment_Year,Item_Outlet_Sales
Item_Fat_Content,,,,,
low fat,12.563988,0.065300,134.569043,1995.883929,2087.740737
Regular,12.705840,0.069564,141.714476,1997.807892,2235.186702
Low Fat,12.953079,0.064166,140.968921,1997.847121,2164.477336
LF,12.803212,0.066628,138.788311,1997.936709,2073.551928
reg,12.842642,0.066361,136.313513,1999.341880,1962.192268

In [16]:
df.groupby(['Item_Type']).mean().sort_values('Item_Outlet_Sales', ascending= False)

,Item_Weight,Item_Visibility,Item_MRP,Outlet_Establishment_Year,Item_Outlet_Sales
Item_Type,,,,,
Starchy Foods,13.690731,0.067564,147.838023,1998.581081,2374.332773
Seafood,12.552843,0.074976,141.841719,1997.734375,2326.065928
Fruits and Vegetables,13.224769,0.068513,144.581235,1997.719968,2289.009592
Snack Foods,12.987880,0.066850,146.194934,1997.886667,2277.321739
Household,13.384736,0.061322,149.424753,1997.784615,2258.784300
Dairy,13.426069,0.072427,148.499208,1997.681818,2232.542597
Canned,12.305705,0.068129,139.763832,1998.152542,2225.194904
Breads,11.346936,0.066255,140.952669,1997.657371,2204.132226
Meat,12.817344,0.062284,139.882032,1997.341176,2158.977911
Hard Drinks,11.400328,0.064943,137.077928,1998.177570,2139.221622
Frozen Foods,12.867061,0.065645,138.503366,1998.024533,2132.867744
Breakfast,12.768202,0.085723,141.788151,1997.336364,2111.808651
Health and Hygiene,13.142314,0.055216,130.818921,1997.734615,2010.000265
Soft Drinks,11.847460,0.063972,131.492506,1998.098876,2006.511735
Baking Goods,12.277108,0.069169,126.380766,1997.728395,1952.971207
Others,13.853285,0.060241,132.851430,1997.662722,1926.139702

## CHECKING FOR DUPLICATE ROWS/COLUMNS

In [17]:
duplicated = df.duplicated().sum()
if duplicated:
    print('Duplicate rows in Dataset are {}'.format(duplicate))
else:
    print('Dataset contains no duplicate values')

Dataset contains no duplicate values

In [18]:
# To drop duplicates, the below function is used:

# df = df.drop_duplicates()

## HANDLING MISSING DATA

For missing values, there are 3 ways to deal with it
1. Leave it as it is
2. Drop them
3. Fill the missing values

In [19]:
# Checking for missing values
df.isnull().sum()

Item_Identifier                 0
Item_Weight                  1463
Item_Fat_Content                0
Item_Visibility                 0
Item_Type                       0
Item_MRP                        0
Outlet_Identifier               0
Outlet_Establishment_Year       0
Outlet_Size                  2410
Outlet_Location_Type            0
Outlet_Type                     0
Item_Outlet_Sales               0
dtype: int64

In [20]:
# This function returns False Statement if at least one column has a missing value
df.notnull().all().all()

False

### Filling a missing value

An empty dataframe usually represented by Nan can either be dropped if it is not significant to the dataframe.
If it is significant or the missing values are little, then, it has to be filled. the appropriate method of filling depends on the nature of the column that contains the empty string.

Categorical Dataset = Fill with mode (i.e the value that appears most)
Numerical/Float dataset = fill with mean or median

if skewed, fill with median
if not skewed, fill with mean or median

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8523 entries, 0 to 8522
Data columns (total 12 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Item_Identifier            8523 non-null   object
 1   Item_Weight                7060 non-null   float64
 2   Item_Fat_Content           8523 non-null   object
 3   Item_Visibility            8523 non-null   float64
 4   Item_Type                  8523 non-null   object
 5   Item_MRP                   8523 non-null   float64
 6   Outlet_Identifier          8523 non-null   object
 7   Outlet_Establishment_Year  8523 non-null   int64
 8   Outlet_Size                6113 non-null   object
 9   Outlet_Location_Type       8523 non-null   object
 10  Outlet_Type                8523 non-null   object
 11  Item_Outlet_Sales          8523 non-null   float64
dtypes: float64(4), int64(1), object(7)
memory usage: 799.2+ KB

In [22]:
# Dropping a particular column

new_df = df.drop('Outlet_Size', axis=1)

new_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8523 entries, 0 to 8522
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Item_Identifier            8523 non-null   object
 1   Item_Weight                7060 non-null   float64
 2   Item_Fat_Content           8523 non-null   object
 3   Item_Visibility            8523 non-null   float64
 4   Item_Type                  8523 non-null   object
 5   Item_MRP                   8523 non-null   float64
 6   Outlet_Identifier          8523 non-null   object
 7   Outlet_Establishment_Year  8523 non-null   int64
 8   Outlet_Location_Type       8523 non-null   object
 9   Outlet_Type                8523 non-null   object
 10  Item_Outlet_Sales          8523 non-null   float64
dtypes: float64(4), int64(1), object(6)
memory usage: 732.6+ KB

In [23]:
# Filling another column
# It is evident now that there is no empty column anymore

new_df2 = new_df.fillna(df.mean())

new_df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8523 entries, 0 to 8522
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Item_Identifier            8523 non-null   object
 1   Item_Weight                8523 non-null   float64
 2   Item_Fat_Content           8523 non-null   object
 3   Item_Visibility            8523 non-null   float64
 4   Item_Type                  8523 non-null   object
 5   Item_MRP                   8523 non-null   float64
 6   Outlet_Identifier          8523 non-null   object
 7   Outlet_Establishment_Year  8523 non-null   int64
 8   Outlet_Location_Type       8523 non-null   object
 9   Outlet_Type                8523 non-null   object
 10  Item_Outlet_Sales          8523 non-null   float64
dtypes: float64(4), int64(1), object(6)
memory usage: 732.6+ KB

In [24]:
new_df2.notnull().all().all()

True